# GetMacroManager Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UIMacroManager..::..GetMacroManager Method
UIMacroManager Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetMacroManager(UIApplication) | Gets the UI Macro manager from the UI application. |
| GetMacroManager(UIDocument) | Gets the UI Macro manager from the UI document. |

# See Also
UIMacroManager Class
UIMacroManager Members
Autodesk.Revit.UI.Macros Namespace